---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.DimensionFlow
source: html/7a3de704-454a-4959-872f-62cda2c46f4f.htm
---
# Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.DimensionFlow Property

The dimension flow which is used to calculate flow of the pipe. Units: (gal/min).

## Syntax (C#)
```csharp
public double DimensionFlow { get; }
```